Repository: yangchenghu/Luma
Catalog: TBImageMgic/Resource/Language/*.lproj/Localizable.strings
Languages: ar, ja, kk, zh_hans

# im_language_des
source: 英文-en
ar: 阿拉伯语-ar
ja: 日文-ja
kk: 哈萨克语-kk
zh_hans: 中文-ch

# 首页
source: Home
ar: الصفحة الرئيسية
ja: ホーム
kk: Басты бет
zh_hans: 首页

# 资料库
source: Library
ar: مكتبة
ja: ライブラリ
kk: База деректері
zh_hans: 资料库

source: Interactive Scenes
ar: المشاهد التفاعلية
ja: インタラクティブ シーン
kk: Интерактивті сценалар
zh_hans: 互动场景

# （可选）描述你想象中的视频
source: (Optional) describe the video you envision
ar: (اختياري) وصف الفيديو الذي تتخيله
ja: （オプション）想像しているビデオを説明する
kk: （қосымша） сіз ойлаған видео туралы сипаттаңыз
zh_hans: （可选）描述你想象中的视频

source: Share with other authors
ar: شارك مع المؤلفين الآخرين
ja: 他の著者と共有する
kk: Басқа авторлармен бөлісіңіз
zh_hans: 与其他作者分享

source: Share your created videos with other creators and receive likes.
ar: شارك مقاطع الفيديو التي أنشأتها مع المبدعين الآخرين وتلقى الإعجابات.
ja: 作成したビデオを他のクリエイターと共有し、「いいね」を受け取る。
kk: Басқа авторлармен сіз жасалған видеоңызды бөлісіңіз және ұнаттылықтар алын.
zh_hans: 分享你创建的视频，与其他创作者互动并获得点赞。

source: Select how many videos to generate
ar: اختر عدد مقاطع الفيديو التي تريد إنشاؤها
ja: 生成するビデオの数を選択する
kk: Жасау үшін қанша видео таңдаңыз
zh_hans: 选择生成的视频数量

# 请选择第二张图片
source: Please select the second image
ar: يرجى اختيار الصورة الثانية
ja: 2 枚目の画像を選択してください
kk: Екінші суретті таңдаңыз
zh_hans: 请选择第二张图片

source: Cancel
ar: إلغاء
ja: キャンセル
kk: Бұтақтаңыз
zh_hans: 取消

source: Save
ar: حفظ
ja: 保存
kk: Сақтаңыз
zh_hans: 保存

# 描述你想象中这张照片发生的动作
source: (Optional) Describe the actions or scene in the photo you imagine, e.g., a pretty lady laughing and dancing happily
ar: (اختياري) وصف الإجراءات أو المشهد في الصورة التي تتخيلها، على سبيل المثال، سيدة جميلة تضحك وترقص بسعادة
ja: （オプション）この写真で想像する動作またはシーンを説明する。たとえば、美しい女性が楽しそうに笑って踊っているなど
kk: （қосымша） сіз ойлаған осы суреттегі әрекеттерді сипаттаңыз,мысалы, әдемі әйел күлкілеріне күлкілей отырып, қуанышты жүр.
zh_hans: （可选）描述你想象中这张照片发生的动作，场景 eg：an pretty lady laughing on dancing happily

source: Your name
ar: اسمك
ja: あなたの名前
kk: Сіздің атыңыз
zh_hans: 你的名字

source: UserName
ar: اسم المستخدم
ja: ユーザー名
kk: Пайдаланушы аты
zh_hans: 用户名

source: Video Renders
ar: مشاهد الفيديو
ja: ビデオ レンダリング
kk: Видео рендерлері
zh_hans: 视频渲染

# 删除视频
source: Delete video
ar: حذف الفيديو
ja: ビデオを削除する
kk: Видеоны өшіру
zh_hans: 删除视频

# 确认删除这个作品吗？
source: Confirm to delete this work?
ar: هل تؤكد حذف هذا العمل؟
ja: この作品を削除することを確認しますか？
kk: Бұл жұмысын өшіруді растайтын ба?
zh_hans: 确认删除这个作品吗？

# 确认
source: Confirm
ar: تأكيد
ja: 確認
kk: Растайлау
zh_hans: 确认

# 取消
source: Cancel
ar: إلغاء
ja: キャンセル
kk: Бұтақтаңыз
zh_hans: 取消

source: Create
ar: إنشاء
ja: 作成
kk: Жасау
zh_hans: 创建

source: Capture with LumaVideo and View IN lifelike, interactive
ar: التقاط مع LumaVideo والاطلاع عليه بطريقة واقعية وتفاعلية
ja: LumaVideo で撮影し、リアルでインタラクティブに表示する
kk: LumaVideoмен түсіру және сізге ұқсас, интерактивті көру
zh_hans: 使用LumaVideo捕捉并以逼真、互动的方式查看

source: You can generate multiple videos simultaneously by AI and select the best result.
ar: يمكنك إنشاء عدة مقاطع فيديو في وقت واحد عن طريق الذكاء الاصطناعي واختيار أفضل النتائج.
ja: AI で同時に複数のビデオを生成し、最良の結果を選択できます。
kk: AI арқылы бір уақытта бірнеше видео жасай аласыз және ең жақсы нәтиже таңдаңыз.
zh_hans: 你可以通过AI同时生成多个视频，并选择最佳结果。

# 上传图片中
source: Uploading image
ar: في عملية رفع الصورة
ja: 画像をアップロード中
kk: Суреттерді жүктеу процесінде
zh_hans: 上传图片中

# 发布中
source: Publishing
ar: نشر جاري
ja: 公開中
kk: Жариялайды
zh_hans: 发布中

source: Created by
ar: أنشأها
ja: 創作者
kk: Шығарушы
zh_hans: 创作者

source: Prompt
ar: موجه
ja: 提示
kk: Нұсқау
zh_hans: 提示

# 余额
source: Balance
ar: المتوفر
ja: 残高
kk: Баланс
zh_hans: 余额

# 充值入口
source: Recharge
ar: مدخل الشحن
ja: チャージ入口
kk: Қолданушыларының сұрақтары
zh_hans: 充值入口

# 历史记录
source: History
ar: سجل التاريخ
ja: 履歴
kk: Тарих
zh_hans: 历史记录

# 联系我们
source: Contact us
ar: تواصل معنا
ja: お問い合わせ
kk: Бізбен байланыс
zh_hans: 联系我们

# 立即制作
source: Try now
ar: اصنع الآن
ja: 今すぐ作成
kk: ЖInstanceState айналдыру
zh_hans: 立即制作

# 大家都在做
source: Such as
ar: مثل الجميع
ja: 皆がやっている
kk: Барлығы жасайды
zh_hans: 大家都在做

source: Purse
ar: محفظة
ja: 財布
kk: Қош
zh_hans: 钱包

# 充值成功
source: Recharge successful
ar: نجاح الشحن
ja: チャージ成功
kk: Қолданушы сұрақтары жетіспеуі
zh_hans: 充值成功

# 重新选择
source: Re-select
ar: اختيار جديد
ja: 再選択
kk: Жената таңдаңыз
zh_hans: 重新选择

# AI 自动生成
source: AI automatic generation
ar: إنشاء تلقائي بواسطة الذكاء الاصطناعي
ja: AI 自動生成
kk: AI аудио жасау
zh_hans: AI 自动生成

# 我要做同款
source: Make the same
ar: أريد صنع نفس النوع
ja: 同じものを作りたい
kk: Бұл түрін жасаймын
zh_hans: 我要做同款

# 更多模板
source: More Templates
ar: المزيد من القوالب
ja: もっと多くのテンプレート
kk: Дәл көп шаблондар
zh_hans: 更多模板

# 保存视频
source: Save video
ar: حفظ الفيديو
ja: ビデオを保存する
kk: Видеоны сақтаңыз
zh_hans: 保存视频

# 再做一张
source: Create another
ar: اصنع أخرى
ja: もう 1 枚作る
kk: Бірінше жасаймын
zh_hans: 再做一张

# 返回首页
source: Return to homepage
ar: العودة إلى الصفحة الرئيسية
ja: ホームページに戻る
kk: Басты бетке оралу
zh_hans: 返回首页

# 已保存到相册
source: Saved to album
ar: حفظت إلى الألبوم
ja: アルバムに保存済み
kk: Альбомға сақталды
zh_hans: 已保存到相册

# 保存失败
source: Save failed
ar: فشل الحفظ
ja: 保存失敗
kk: Сақтау сәтсіз болды
zh_hans: 保存失败

# 保存中
source: Saving
ar: جاري الحفظ
ja: 保存中
kk: Сақталады
zh_hans: 保存中

# 下载中
source: Downloading
ar: تحميل جاري
ja: ダウンロード中
kk: Жүктеу процесінде

# 预计完成时间
source: Estimated Completion Time
ar: وقت الإكمال المتوقع
ja: 予想完了時間
kk: Тақ离愁lánтып аяқталатын уақыт
zh_hans: 预计完成时间

# 已完成
source: Completed
ar: مكتمل
ja: 完了
kk: Аяқталды
zh_hans: 已完成

# 立刻查看
source: View Now
ar: اطلع الآن
ja: すぐに確認
kk: ЖInstanceState тексеру
zh_hans: 立刻查看

# 超时错误提示
source: Request timed out, please check the history record.
ar: انتهت مهلة الطلب، يرجى التحقق من سجل التاريخ.
ja: リクエストがタイムアウトしました、履歴記録を確認してください。
kk: Сұрақтар уақыт aşылған, тарихты тексеру
zh_hans: 请求超时，请去历史记录查看

# 暂无生成内容
source: No generated content
ar: لا يوجد محتوى تم إنشاؤه
ja: 生成内容なし
kk: Жасалған мазмұн жоқ
zh_hans: 暂无生成内容

# 生成中
source: Generating
ar: جاري الإنشاء
ja: 生成中
kk: Жасау процесінде
zh_hans: 生成中

# 做的怎么样
source: How did it go?
ar: كيف كان؟
ja: どうだった？
kk: Қалай болды?
zh_hans: 做的怎么样?

# 是否要重新制作?
source: Do you want to remake it?
ar: هل تريد إعادة إنتاجه؟
ja: 再作成しますか？
kk: Қайта жасайсыз ба?
zh_hans: 是否要重新制作?

# 重做
source: Redo
ar: إعادة
ja: 再作成
kk: Қайта жасау
zh_hans: 重做

# 输入一些提示
source: Enter some prompts
ar: أدخل بعض الإرشادات
ja: ヒントを入力
kk: Кейбір нұсқауларды енгізіңіз
zh_hans: 输入一些提示

# 文字生成视频
source: Text to video
ar: تحويل النص إلى فيديو
ja: テキストから動画生成
kk: Мәтіннен бейне жасау
zh_hans: 文字生成视频

# 图片生成视频
source: Image to video
ar: تحويل الصورة إلى فيديو
ja: 画像から動画生成
kk: Суреттен бейне жасау
zh_hans: 图片生成视频

# 请输入内容
source: Please input content
ar: الرجاء إدخال المحتوى
ja: 内容を入力してください
kk: Мазмұнды енгізіңіз
zh_hans: 请输入内容

# 风格模板
source: AI Video idea
ar: فكرة فيديو الذكاء الاصطناعي
ja: AIビデオのアイデア
kk: AI Video g'oyasi
zh_hans: AI视频创意

# 生成时长
source: Duration
ar: المدة
ja: 生成時間
kk: Ұзақтығы
zh_hans: 生成时长

# 生成模式
source: Mode
ar: الوضع
ja: モード
kk: Режим
zh_hans: 生成模式

# 高性能
source: Speed
ar: السرعة
ja: スピード
kk: Жылдамдық
zh_hans: 高性能

# 高表现
source: Quality
ar: الجودة
ja: 品質
kk: Сапа
zh_hans: 高表现

# 生成速度更快，创作成本更低
source: Faster generation speed, lower creative costs
ar: سرعة توليد أسرع وتكلفة إبداعية أقل
ja: 生成速度が速く、創作コストが低い
kk: Генерация жылдамырақ, шығармашылық шығындар аз
zh_hans: 生成速度更快，创作成本更低

# 视频画面质量更加，需要更多的制作时间，创作成本高
source: Higher video quality, requires more production time, higher creative costs
ar: جودة فيديو أعلى، تتطلب وقت إنتاج أطول وتكلفة إبداعية أعلى
ja: ビデオ品質が高く、制作時間が長くなり、創作コストが高い
kk: Бейненің сапасы жоғары, өндіріс уақыты көп, шығармашылық шығындар жоғары
zh_hans: 视频画面质量更加，需要更多的制作时间，创作成本高

# 驯服AI中
source: Taming AI
zh_hans: 驯服AI中
